#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-65sQuFaUxws8yuGn

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.web.data.aws_iam_policy_document.jowe_web_s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "jowe_web_s3_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.web.aws_cloudfront_distribution.jowe_web will be created
  + resource "aws_cloudfront_distribution" "jowe_web" {
      + aliases                        = [
          + "jowe-dev.initialised.si",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "jowe-web"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "App"         = "JoWe"
          + "Environment" = "dev"
          + "Name"        = "JoWe-web"
        }
      + tags_all                       = {
          + "App"         = "JoWe"
          + "Environment" = "dev"
          + "Name"        = "JoWe-web"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + custom_error_response {
          + error_caching_min_ttl = 0
          + error_code            = 400
          + response_code         = 200
          + response_page_path    = "/index.html"
        }
      + custom_error_response {
          + error_caching_min_ttl = 0
          + error_code            = 403
          + response_code         = 200
          + response_page_path    = "/index.html"
        }
      + custom_error_response {
          + error_caching_min_ttl = 0
          + error_code            = 404
          + response_code         = 200
          + response_page_path    = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 7200
          + min_ttl                = 300
          + target_origin_id       = "jowe-dev.initialised.si"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "jowe-dev.initialised.si"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "AT",
                  + "CH",
                  + "DE",
                  + "HR",
                  + "JP",
                  + "PH",
                  + "SI",
                ]
              + restriction_type = "whitelist"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:834514932971:certificate/f39eaf44-37dc-4ba9-95d3-eb190b7241c6"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.web.aws_cloudfront_origin_access_identity.jowe_web will be created
  + resource "aws_cloudfront_origin_access_identity" "jowe_web" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "jowe-dev.initialised.si"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.web.aws_s3_bucket.jowe_web will be created
  + resource "aws_s3_bucket" "jowe_web" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "jowe-dev.initialised.si"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "App"         = "JoWe"
          + "Environment" = "dev"
          + "Name"        = "JoWe-web"
        }
      + tags_all                    = {
          + "App"         = "JoWe"
          + "Environment" = "dev"
          + "Name"        = "JoWe-web"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.web.aws_s3_bucket_acl.jowe_web will be created
  + resource "aws_s3_bucket_acl" "jowe_web" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.web.aws_s3_bucket_ownership_controls.jowe_web will be created
  + resource "aws_s3_bucket_ownership_controls" "jowe_web" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.web.aws_s3_bucket_policy.jowe_web will be created
  + resource "aws_s3_bucket_policy" "jowe_web" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.web.aws_s3_bucket_public_access_block.jowe_web will be created
  + resource "aws_s3_bucket_public_access_block" "jowe_web" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.web.aws_s3_bucket_versioning.jowe_web will be created
  + resource "aws_s3_bucket_versioning" "jowe_web" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "004b01eeabad1a9cb650b2652f761455"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//asset-manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["favicon.ico"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = "5b08b3f17508d9fe42f47af44a6c43a7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "8b801c74036c6ade824c2b33b076ea75"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["manifest.json"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "8cd6ce210222bb98a8fb82ecba88da95"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "46285113d0bb2f0e3a0379312c745d30"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/106.872b5878.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/106.872b5878.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "51df6f56e277df51b0c07bd8f95368a3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/106.872b5878.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/106.872b5878.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "4c7cb1a7f8796dab59ac62aa3b6246b0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/777.872b5878.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/777.872b5878.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "dc64abd5956a9dabb5d11de8b07dc20b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/777.872b5878.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/777.872b5878.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "6c2fd5590c5c2513ecfd992d627816ed"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/915.35ba84bd.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/915.35ba84bd.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d798a776ea1cf5ed12376c4af3cac80f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/915.35ba84bd.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/915.35ba84bd.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "189f9cf8f9cfb48860798f7d3472214e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.af03688d.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.af03688d.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "692c6929da3c9c0edba61a155802befa"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.af03688d.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.af03688d.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "2a671af63604493ca8eb6af138f185b6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/106.74767f96.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/106.74767f96.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a013b981d84d628e37bb579ba5a40cb6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/106.74767f96.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/106.74767f96.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "09ca10f1dfcd96f757c65beb386b72a9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/356.ab45c9e7.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/356.ab45c9e7.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "686f404fb6748c84bd90802c573b89fc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/356.ab45c9e7.chunk.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/356.ab45c9e7.chunk.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "f48c12b57f9f00e32637422c8eac9091"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/356.ab45c9e7.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/356.ab45c9e7.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "04c7cdcdc176f4da16b66d6624cd0c36"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/496.c9f3cc61.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/496.c9f3cc61.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "38d4bc2e5ff8434c0105d54165fbf8dc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/496.c9f3cc61.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/496.c9f3cc61.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "0a057486c8ce9e61de1b9d22af27081b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/698.1c688865.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/698.1c688865.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "f2facf35e8bea74ca7f4257ea5772273"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/698.1c688865.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/698.1c688865.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "9fe79362421c77f81aaef81bc999714c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/726.e869980a.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/726.e869980a.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "1399e449ab9a495cbe256011b57cd5ac"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/726.e869980a.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/726.e869980a.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "5471791775fa3fb2f34292fa04ee78b7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/777.3fc69ada.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/777.3fc69ada.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "16d187c880b27b3a27c95fd60cb93649"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/777.3fc69ada.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/777.3fc69ada.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "c06d9f8890056a09e0770151536fd20a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/915.2b20329f.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/915.2b20329f.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a8020211c626604acd9657c1c1740efd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/915.2b20329f.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/915.2b20329f.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "48473abaac3ae3414761cbbe6def85b9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.d545cbce.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.d545cbce.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "39758b8e8e8eea4d407cd3619a60faac"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.d545cbce.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.d545cbce.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e5a98d92.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "21680880856c22ee93f287ca3f386557"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e5a98d92.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e5a98d92.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e5a98d92.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "e3f71d2c7f7fb57d48ae08488b42fd48"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e5a98d92.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e5a98d92.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e5a98d92.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "b10d7fdfb9cbd41bf19196af9672855e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e5a98d92.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e5a98d92.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "c5e14ee52f54ee1cac66f7187610367a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "2fe28c6f8448507dee01ab4d69fbd351"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 42 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*